BEGIN {
  rank = 0;
  cnt = 0;
  ts = substr(ARGV[1], 12, 14);
} 

{
  if ($2 == 0) {
    rank = rank + 1;
  } 
  if (($1 == "ÅºÇÙ" && rank == 1) ||
      ($1 == "ÀÌ¸í¹Ú ÅºÇÙ" && rank == 2) ||
      ($1 == "ÀÌ¸í¹Ú" && rank == 3) ||
      ($1 == "±¤¿ìº´" && rank == 4) ||
      ($1 == "ÀÌ¸í¹Ú ±¤¿ìº´" && rank == 5) ||
      ($1 == "ÀÌ¸í¹Ú ÅºÇÙ ¼­¸í" && rank == 6) ||
      ($1 == "±¤¿ìº´ Áõ»ó" && rank == 7) ||
      ($1 == "ÀÌ¸í¹Ú ¹Ì´ÏÈ¨ÇÇ" && rank == 8) ||
      ($1 == "pd¼öÃ¸" && rank == 9) ||
      ($1 == "±¤¿ìº´ ¿¹¹æ" && rank == 10)) {
      cnt = cnt + 1;
  } 
} 

END {
    if (cnt == 10) {
	print ARGV[1];
    }
}
